---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleData.GetLoadClassifications
source: html/bdcb0fa5-478c-c968-d224-9444bc850fd7.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.GetLoadClassifications Method

Gets an array of the load classifications associated with this panel schedule

## Syntax (C#)
```csharp
public IList<ElementId> GetLoadClassifications()
```

## Returns
The array of the load classifications